#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Shops
#+STARTUP: showall
#+PROPERTY: filename
  :PROPERTIES:
  :Name: /home/deerpig/proj/chenla/deploy/deploy-shops.org
  :Created: 2017-03-27T09:38@Prek Leap (11.642600N-104.919210W)
  :ID: a4eb6dc0-38c3-4838-b671-81fd2210b9c8
  :URL:
  :END:
#+INCLUDE: ./inc/head.org
#+INCLUDE: ./inc/macros.org

{{{breadcrumbs}}}

#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 4


* Status of This Document

The latest version of this document is: src_sh[:results value]{git describe --abbrev=0 --tags}

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.01.02"
  RES='git log $TAG...HEAD --pretty="<li>%s</li>\n" -- (file-name-nondirectory (buffer-file-name))'
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>

* Introduction

  - [[https://en.wikipedia.org/wiki/Workshop][Workshop]]    | Wikipedia
  - [[https://en.wikipedia.org/wiki/Studio][Studio]]      | Wikipedia
  - [[https://en.wikipedia.org/wiki/Laboratory][Laboratory]]  | Wikipedia
  - [[https://en.wikipedia.org/wiki/Hackerspace][Hackerspace]] | Wikipedia

  - the right size
  - standardization
  - modular
  - the new just-in-time


I've certainly been thinking about this a very long time, and yet here
I am trying to write it all out and I'm a little at a loss.

When I say shop here, I don't mean a retail store, though many shops
will also have a retail front end, like a bakery, deli, repair shop.  But
many shops don't premake retail goods.

A shop is a place where things are made, usually with a master and a
small number of employees and a long time ago, apprentices.

Things are produced that are high in quality, often bespoke, and
artisanal.


shops short for workshop.  I like the french word
/atelier/ because of its connotations with being the home of an
alchemist of wizard (wikipedia: studio).

other terms such as studio and laboratory are also shops but don't
have the retail or commercial connotation that shop has.

more recently the term hackspace has emerged -- which is sort of part
workshop, office, and classroom.


